# Housing Market

### Introduction:

This time we will create our own dataset with fictional numbers to describe a house market. As we are going to create random data don't try to reason of the numbers.

### Step 1. Import the necessary libraries

In [2]:
import matplotlib.pyplot as plt
import pandas as pd
import datetime as dt
import os
import numpy as np

### Step 2. Create 3 differents Series, each of length 100, as follows: 
1. The first a random number from 1 to 4 
2. The second a random number from 1 to 3
3. The third a random number from 10,000 to 30,000

In [3]:
series1 = pd.Series(np.random.randint(1, high=5, size=100, dtype='l'))
series2 = pd.Series(np.random.randint(1, high=4, size=100, dtype='l'))
series3 = pd.Series(np.random.randint(10000, high=30001, size=100, dtype='l'))

In [4]:
print(series1,series2,series3)

0     2
1     3
2     2
3     1
4     2
     ..
95    4
96    3
97    1
98    3
99    4
Length: 100, dtype: int32 0     2
1     2
2     3
3     3
4     3
     ..
95    1
96    3
97    1
98    3
99    2
Length: 100, dtype: int32 0     19852
1     20423
2     20431
3     12867
4     17438
      ...
95    24039
96    29222
97    19109
98    21066
99    14623
Length: 100, dtype: int32

### Step 3. Let's create a DataFrame by joinning the Series by column

In [5]:
home = pd.concat([series1, series2, series3], axis=1)

In [6]:
home

    0  1      2
0   2  2  19852
1   3  2  20423
2   2  3  20431
3   1  3  12867
4   2  3  17438
.. .. ..    ...
95  4  1  24039
96  3  3  29222
97  1  1  19109
98  3  3  21066
99  4  2  14623

[100 rows x 3 columns]

### Step 4. Change the name of the columns to bedrs, bathrs, price_sqr_meter

In [7]:
home.rename(columns={0:'bedrooms',1:'bathrooms',2:'price_sqr_meter'})

    bedrooms  bathrooms  price_sqr_meter
0          2          2            19852
1          3          2            20423
2          2          3            20431
3          1          3            12867
4          2          3            17438
..       ...        ...              ...
95         4          1            24039
96         3          3            29222
97         1          1            19109
98         3          3            21066
99         4          2            14623

[100 rows x 3 columns]

### Step 5. Create a one column DataFrame with the values of the 3 Series and assign it to 'bigcolumn'

In [8]:

bigcolumn = pd.concat([series1, series2, series3], axis=0)

In [9]:
bigcolumn = bigcolumn.to_frame()
print(type(bigcolumn))

bigcolumn

<class 'pandas.core.frame.DataFrame'>

        0
0       2
1       3
2       2
3       1
4       2
..    ...
95  24039
96  29222
97  19109
98  21066
99  14623

[300 rows x 1 columns]

### Step 6. Oops, it seems it is going only until index 99. Is it true?

In [10]:
len(bigcolumn)

300

### Step 7. Reindex the DataFrame so it goes from 0 to 299

In [11]:
bigcolumn.reset_index(drop=True, inplace=True)

In [12]:

bigcolumn

         0
0        2
1        3
2        2
3        1
4        2
..     ...
295  24039
296  29222
297  19109
298  21066
299  14623

[300 rows x 1 columns]